# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

x = input('Введите 3-х значное число-')
print (x)
print ('Сумма цифр трехзначного числа', (int(x[0]) + int(x[1]) + int(x[2])))
print ('Произведение цифр трехзначного числа', (int(x[0]) * int(x[1]) * int(x[2])))
